tutorials/multicomponentFluid/membrane/Allrun
#!/bin/sh
cd ${0%/*} || exit 1    # Run from this directory

# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

runApplication blockMesh
runApplication snappyHexMesh
runApplication createBaffles

runApplication setFields

runApplication foamRun

#------------------------------------------------------------------------------
