tutorials/multicomponentFluid/membrane/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include "../0/include"

defaultValues
{
    CH4 $!sleeve/CH4;
    N2  $!sleeve/N2;
    O2  $!sleeve/O2;
}

zones
{
    pipe
    {
        type        lookup;

        values
        {
            CH4 $!pipe/CH4;
            N2  $!pipe/N2;
            O2  $!pipe/O2;
        }
    }
}

// ************************************************************************* //
